Гаджетонов/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Гаджетонов/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокПрав.Очистить();
	
	НаборРолей = Метаданные.Роли;
	Для Каждого ТекРоль Из НаборРолей Цикл
		
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли =ТекРоль.Имя;
		СтрокаРоли.ПредставлениеРоли = ТекРоль.Синоним;
		СтрокаРоли.Включено = ПользовательСеанса.Роли.Содержит(ТекРоль);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если НЕ (ПользовательСеанса = Неопределено) Тогда
		НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользовательИБ.Имя = Наименование;
		НовыйПользовательИБ.ПолноеИмя = ПолноеИмяПользователя;
		
	КонецЕсли;
	 
	 ПользовательСеанса.Роли.Очистить();
	 
	 СписокСтрокРолей = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	 
	 Для Каждого СтрокаРоли Из СписокСтрокРолей Цикл
	 	ПользовательСеанса.Роли.Добавить(Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли));
	 	
	 	
	 	
	 КонецЦикла;
	ПользовательСеанса.Записать();
	
КонецПроцедуры
